Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Услуги
	Движения.Услуги.Записывать = Истина;
	Движение = Движения.Услуги.Добавить();
	Движение.Период = Дата;
	Движение.ДатаДокумента = ДатаНачалаМесяца;
	Движение.Газ = НовГаз;
	Движение.Свет = НовСвет;
	Движение.Вода = НовВода;
	Движение.РасходГаз = РазницаГаз;
	Движение.РасходСвет = РазницаСвет;
	Движение.РасходВода = РазницаВода;


	// регистр РасходыУслуг 
	Движения.РасходыУслуг.Записывать = Истина;
	Движение = Движения.РасходыУслуг.Добавить();
	Движение.Период = Дата;
	Движение.Периодрасхода = ДатаНачалаМесяца;
	Движение.Газ = РазницаГаз;
	Движение.Свет = РазницаСвет;
	Движение.Вода = РазницаВода;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЭтотОбъект.ДатаНачалаМесяца = Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()) - 1, 01);
	//МесяцСтрокой = ОбработкаДатыВыбора.ПолучитьПредставлениеМесяца(ДатаНачалаМесяца);
//ЭтаФорма.Элементы.МесяцСтрокой.Значение  = Формат(ЭтотОбъект.ДатаНачалаМесяца,"ДФ='MMMM гггг'") + " г.";

КонецПроцедуры
Процедура ПолучитьПоказанияНаСервере(датаДокуметна) Экспорт
	Если Не месяц(датаДокуметна) = 1 И год(датаДокуметна) = Год(ТекущаяДата()) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Услуги.Период КАК Период,
		|	Услуги.ДатаДокумента КАК Дата,
		|	ЕСТЬNULL(Услуги.Газ, 0) КАК Газ,
		|	ЕСТЬNULL(Услуги.Свет, 0) КАК Свет,
		|	ЕСТЬNULL(Услуги.Вода, 0) КАК Вода
		|ИЗ
		|	РегистрСведений.Услуги КАК Услуги
		|ГДЕ
		|	МЕСЯЦ(Услуги.ДатаДокумента) =МЕСЯЦ(&Период)-1
		|	И ГОД(Услуги.ДатаДокумента) = ГОД(&Период)";
		Запрос.УстановитьПараметр("Период", датаДокуметна);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Сообщить("данных за предыдущий период нет!!!запрос пустой");

		Иначе

			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЭтотОбъект.СтСвет = ВыборкаДетальныеЗаписи.свет;
				ЭтотОбъект.СтГаз = ВыборкаДетальныеЗаписи.Газ;
				ЭтотОбъект.СтВода = ВыборкаДетальныеЗаписи.Вода;

			КонецЦикла;
		КонецЕсли;
	ИначеЕсли месяц(датаДокуметна) = 1 И год(датаДокуметна) = Год(ТекущаяДата()) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Услуги.Период КАК Период,
		|	Услуги.ДатаДокумента КАК Дата,
		|	ЕСТЬNULL(Услуги.Газ, 0) КАК Газ,
		|	ЕСТЬNULL(Услуги.Свет, 0) КАК Свет,
		|	ЕСТЬNULL(Услуги.Вода, 0) КАК Вода
		|ИЗ
		|	РегистрСведений.Услуги КАК Услуги
		|ГДЕ
		|	МЕСЯЦ(Услуги.ДатаДокумента) =12
		|	И ГОД(Услуги.ДатаДокумента) = ГОД(&Период)-1";
		Запрос.УстановитьПараметр("Период", датаДокуметна);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Сообщить("данных за предыдущий период нет!!!запрос пустой");

		Иначе

			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЭтотОбъект.СтСвет = ВыборкаДетальныеЗаписи.свет;
				ЭтотОбъект.СтГаз = ВыборкаДетальныеЗаписи.Газ;
				ЭтотОбъект.СтВода = ВыборкаДетальныеЗаписи.Вода;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры